tangyangguang/FarmAuto/apps/Esp32FarmDoor/src/FarmDoorApp.cpp
bool readTrustLevelParam(PositionTrustLevel& out) {
  char raw[16];
  if (!Esp32BaseWeb::getParam("trustLevel", raw, sizeof(raw))) {
    out = PositionTrustLevel::Trusted;
    return true;
  }
  if (strcmp(raw, "Trusted") == 0 || strcmp(raw, "trusted") == 0) {
    out = PositionTrustLevel::Trusted;
    return true;
  }
  if (strcmp(raw, "Limited") == 0 || strcmp(raw, "limited") == 0) {
    out = PositionTrustLevel::Limited;
    return true;
  }
  if (strcmp(raw, "Untrusted") == 0 || strcmp(raw, "untrusted") == 0) {
    out = PositionTrustLevel::Untrusted;
    return true;
  }
  return false;
}

void applyRuntimeConfigFromBase() {
#if ESP32BASE_ENABLE_APP_CONFIG
  const int32_t speedPercent = Esp32BaseConfig::getInt("door", "speed", 60);
  const int32_t openTurnsX100 = Esp32BaseConfig::getInt("door", "openTurns", 500);
  const int32_t maxRunMs = Esp32BaseConfig::getInt("door", "maxRunMs", 25000);
  const bool requestedCurrentGuard =
      Esp32BaseConfig::getBool("door", "currentGuard", false);

  if (speedPercent >= 10 && speedPercent <= 100) {
    g_motorProfile.speedPercent = static_cast<uint8_t>(speedPercent);
  }
  if (openTurnsX100 > 0) {
    g_doorConfig.openTargetPulses = openTargetPulsesFromTurnsX100(openTurnsX100);
    g_doorConfig.maxRunPulses = defaultMaxRunPulsesForTarget(g_doorConfig.openTargetPulses);
    g_motorProtection.maxRunPulses = g_doorConfig.maxRunPulses;
  }
  if (maxRunMs > 0) {
    g_doorConfig.maxRunMs = static_cast<uint32_t>(maxRunMs);
    g_motorProtection.maxRunMs = g_doorConfig.maxRunMs;
  }
  const DoorSnapshot snapshot = g_door.snapshot();
  if (snapshot.state != DoorState::Opening && snapshot.state != DoorState::Closing) {
    g_door.configure(g_doorConfig);
  }
  g_currentGuard.enabled = ina240CompileEnabled() && requestedCurrentGuard;
#else
  g_currentGuard.enabled = false;
#endif
}

void sendCommandResultJson(DoorCommandResult result) {
#if ESP32BASE_ENABLE_WEB
  const DoorSnapshot snapshot = g_door.snapshot();
  Esp32BaseWeb::beginJson(httpCodeFor(result));
  Esp32BaseWeb::sendChunk("{\"result\":\"");
  Esp32BaseWeb::sendChunk(commandResultName(result));
  Esp32BaseWeb::sendChunk("\",\"state\":\"");
  Esp32BaseWeb::sendChunk(stateName(snapshot.state));
  Esp32BaseWeb::sendChunk("\",\"activeCommand\":\"");
  Esp32BaseWeb::sendChunk(commandName(snapshot.activeCommand));
  Esp32BaseWeb::sendChunk("\",\"positionPulses\":");
  sendInt64(snapshot.positionPulses);
  Esp32BaseWeb::sendChunk(",\"targetPulses\":");
  sendInt64(snapshot.targetPulses);
  Esp32BaseWeb::sendChunk(",\"motorOutput\":{\"enabled\":false}}");
  Esp32BaseWeb::endJson();
#endif
}

void sendTravelResultJson(DoorCommandResult result, bool configSaved) {
#if ESP32BASE_ENABLE_WEB
  const DoorSnapshot snapshot = g_door.snapshot();
  Esp32BaseWeb::beginJson(httpCodeFor(result));
  Esp32BaseWeb::sendChunk("{\"result\":\"");
  Esp32BaseWeb::sendChunk(commandResultName(result));
  Esp32BaseWeb::sendChunk("\",\"state\":\"");
  Esp32BaseWeb::sendChunk(stateName(snapshot.state));
  Esp32BaseWeb::sendChunk("\",\"openTargetPulses\":");
  sendInt64(snapshot.openTargetPulses);
  Esp32BaseWeb::sendChunk(",\"openTurnsX100\":");
  sendInt64(turnsX100FromOpenTargetPulses(snapshot.openTargetPulses));
  Esp32BaseWeb::sendChunk(",\"maxRunPulses\":");
  sendInt64(g_doorConfig.maxRunPulses);
  Esp32BaseWeb::sendChunk(",\"configSaved\":");
  Esp32BaseWeb::sendChunk(configSaved ? "true" : "false");
  Esp32BaseWeb::sendChunk(",\"motorOutput\":{\"enabled\":false}}");
  Esp32BaseWeb::endJson();
#endif
}

DoorCommandResult applyTravelUpdate(int64_t openTargetPulses,
                                    int64_t maxRunPulses,
                                    bool& configSaved) {
  configSaved = false;
  if (openTargetPulses <= g_doorConfig.closedPositionPulses || maxRunPulses <= 0) {
    return DoorCommandResult::InvalidArgument;
  }

  const DoorControllerConfig oldDoorConfig = g_doorConfig;
  const int64_t oldProtectionMaxRunPulses = g_motorProtection.maxRunPulses;
  g_doorConfig.openTargetPulses = openTargetPulses;
  g_doorConfig.maxRunPulses = maxRunPulses;
  g_motorProtection.maxRunPulses = maxRunPulses;

  const DoorCommandResult result = g_door.updateTravel(openTargetPulses, maxRunPulses);
  if (result != DoorCommandResult::Ok) {
    g_doorConfig = oldDoorConfig;
    g_motorProtection.maxRunPulses = oldProtectionMaxRunPulses;
    return result;
  }

#if ESP32BASE_ENABLE_APP_CONFIG
  const int64_t turnsX100 = turnsX100FromOpenTargetPulses(openTargetPulses);
  if (turnsX100 > 0 && turnsX100 <= 2000) {
    configSaved = Esp32BaseConfig::setInt("door", "openTurns", static_cast<int32_t>(turnsX100));
  }
#endif
  return result;
}

#if ESP32BASE_ENABLE_APP_CONFIG
void onAppConfigChange(const Esp32BaseAppConfig::Change& change) {
  if (change.field.ns && change.field.key && strcmp(change.field.ns, "door") == 0 &&
      strcmp(change.field.key, "currentGuard") == 0) {
    applyRuntimeConfigFromBase();
    ESP32BASE_LOG_I("farmdoor", "current_guard_runtime_enabled=%s",
                    g_currentGuard.enabled ? "yes" : "no");
  }
}
#endif

}  // namespace

FarmDoorApp FarmDoor;

void FarmDoorApp::begin() {
  Serial.begin(115200);
  configureStaticDefaults();
  configureHardwareInputs();

  Esp32Base::setFirmwareInfo("Esp32FarmDoor", "0.1.0");
  configureAppConfigPage();
  configureBusinessShell();

  if (!Esp32Base::begin()) {
    ESP32BASE_LOG_E("farmdoor", "Esp32Base begin failed: %s", Esp32Base::lastError());
  } else {
    applyRuntimeConfigFromBase();
    ESP32BASE_LOG_I("farmdoor", "skeleton ready, ina240a2_gpio=%u enabled=%s",
                    FarmDoorHw.pins().currentAdc,
                    g_currentGuard.enabled ? "yes" : "no");
  }
}

void FarmDoorApp::handle() {
  Esp32Base::handle();
}

void FarmDoorApp::configureHardwareInputs() {
  FarmDoorHw.begin(FarmDoorHardwarePins{});
}

void FarmDoorApp::configureStaticDefaults() {
  g_motorHardware.driverType = Esp32EncodedDcMotor::DriverType::At8236HBridge;
  g_motorHardware.pwmFrequencyHz = 20000;
  g_motorHardware.pwmResolutionBits = 8;
  g_motorHardware.ledcChannelA = 0;
  g_motorHardware.ledcChannelB = 1;

