tangyangguang/FarmAuto/apps/Esp32FarmDoor/src/FarmDoorApp.cpp
void FarmDoorApp::handleSetPosition() {
#if ESP32BASE_ENABLE_WEB
  char position[16];
  if (Esp32BaseWeb::getParam("position", position, sizeof(position))) {
    if (strcmp(position, "closed") == 0 || strcmp(position, "Closed") == 0) {
      sendCommandResultJson(g_door.markPositionClosed());
      return;
    }
    if (strcmp(position, "open") == 0 || strcmp(position, "Open") == 0) {
      sendCommandResultJson(g_door.markPositionOpen());
      return;
    }
    if (strcmp(position, "unknown") == 0 || strcmp(position, "Unknown") == 0) {
      sendCommandResultJson(g_door.setTrustedPosition(0, PositionTrustLevel::Untrusted));
      return;
    }
    sendCommandResultJson(DoorCommandResult::InvalidArgument);
    return;
  }

  int64_t positionPulses = 0;
  PositionTrustLevel trustLevel = PositionTrustLevel::Trusted;
  if (!readInt64Param("positionPulses", positionPulses) || !readTrustLevelParam(trustLevel)) {
    sendCommandResultJson(DoorCommandResult::InvalidArgument);
    return;
  }
  sendCommandResultJson(g_door.setTrustedPosition(positionPulses, trustLevel));
#endif
}

void FarmDoorApp::handleSetTravel() {
#if ESP32BASE_ENABLE_WEB
  int64_t openTargetPulses = 0;
  int64_t openTurnsX100 = 0;
  const bool hasPulses = hasParam("openTargetPulses");
  const bool hasTurns = hasParam("openTurnsX100");
  if (hasPulses) {
    if (!readInt64Param("openTargetPulses", openTargetPulses)) {
      sendTravelResultJson(DoorCommandResult::InvalidArgument, false);
      return;
    }
  } else if (hasTurns) {
    if (!readInt64Param("openTurnsX100", openTurnsX100)) {
      sendTravelResultJson(DoorCommandResult::InvalidArgument, false);
      return;
    }
    openTargetPulses = openTargetPulsesFromTurnsX100(openTurnsX100);
  } else {
    sendTravelResultJson(DoorCommandResult::InvalidArgument, false);
    return;
  }

  int64_t maxRunPulses = defaultMaxRunPulsesForTarget(openTargetPulses);
  if (!readInt64ParamOptional("maxRunPulses", maxRunPulses)) {
    sendTravelResultJson(DoorCommandResult::InvalidArgument, false);
    return;
  }

  bool configSaved = false;
  const DoorCommandResult result = applyTravelUpdate(openTargetPulses, maxRunPulses, configSaved);
  sendTravelResultJson(result, configSaved);
#endif
}

void FarmDoorApp::handleAdjustTravel() {
#if ESP32BASE_ENABLE_WEB
  int64_t deltaPulses = 0;
  int64_t deltaTurnsX100 = 0;
  const bool hasDeltaPulses = hasParam("deltaPulses");
  const bool hasDeltaTurns = hasParam("deltaTurnsX100");
  if (hasDeltaPulses) {
    if (!readInt64Param("deltaPulses", deltaPulses)) {
      sendTravelResultJson(DoorCommandResult::InvalidArgument, false);
      return;
    }
  } else if (hasDeltaTurns) {
    if (!readInt64Param("deltaTurnsX100", deltaTurnsX100)) {
      sendTravelResultJson(DoorCommandResult::InvalidArgument, false);
      return;
    }
    deltaPulses = openTargetPulsesFromTurnsX100(deltaTurnsX100);
  } else {
    sendTravelResultJson(DoorCommandResult::InvalidArgument, false);
    return;
  }

  const int64_t openTargetPulses = g_door.snapshot().openTargetPulses + deltaPulses;
  const int64_t maxRunPulses = defaultMaxRunPulsesForTarget(openTargetPulses);
  bool configSaved = false;
  const DoorCommandResult result = applyTravelUpdate(openTargetPulses, maxRunPulses, configSaved);
  sendTravelResultJson(result, configSaved);
#endif
}

void FarmDoorApp::handleClearFault() {
#if ESP32BASE_ENABLE_WEB
  sendCommandResultJson(g_door.clearFault());
#endif
}
